{
  "title.home": "Rodrigo Cury - Home",
  "title.exp": "Rodrigo Cury - Experience",
  "title.tech": "Rodrigo Cury - Technologies",
  "title.contact": "Rodrigo Cury - Contact Me",
  "contact.me.form.email": "Email",
  "contact.me.form.message": "Message",
  "contact.me.form.name": "Name",
  "contact.me.form.send": "Send",
  "contact.me.form.send.error": "Error sending message, please try again later",
  "contate-me": "contact me",
  "cury": "CURY",
  "desenvolvedor.backend.pleno": "Mid-Level Backend Developer",
  "experiencia": "Experience",
  "languages.java": "Java",
  "languages.java.description": "No meu dia-a-dia, lado a lado do Kotlin, Uso para desenvolver e fazer manutenção de sistemas backend escritos em Java, como Spring e Serviços Java EE (Web, JDBC, Tomcat). Podendo trabalhar em serviços reativos ou imperativos",
  "languages.kotlin": "Kotlin",
  "languages.kotlin.description": "My primary language along with Java, I use in my day to day life to develop Back End services. You can use it imperative or reactive",
  "languages.nodejs": "Node.JS",
  "languages.nodejs.description": "Node is my wildcard language, I use it for Front End development, process automation and Back End development. I've built and maintained websites, crawlers (Puppeteer), API's, among others...",
  "languages.python": "Python",
  "languages.python.description": "Python was my first passion, with it I learned to code, Back end concepts, automation and database manipulation. I've done projects using Django and Flask.",
  "name.first": "Rodrigo",
  "name.last": "Cury",
  "rodrigo.cury": "Rodrigo Cury",
  "technology.aws": "AWS",
  "technology.aws.description": "I have experience working with AWS development tools such as Lambda, SQS, RDS, S3, EC2, and ElastiCache. As well as using LocalStack to mock AWS services locally.",
  "technology.docker": "Docker",
  "technology.docker.description": "I work with Docker on a daily basis to develop in identical environments to production and decrease inconsistencies between development environments, as well as versioning.",
  "technology.front": "Front End",
  "technology.front.description": "My specialization is Back End, but I love working with creative interfaces in my spare time. I have a good understanding of React.js. I can work well with HTML, CSS and JS natively. I am passionate about working with Three.js to create 3D interfaces. Professionally, whenever needed, I will help the Front End team in their deliveries.",
  "technology.git": "Git",
  "technology.git.description": "Git is the most efficient way of versioning code, and professionally I have experience using Github and Bitbucket.",
  "technology.kafka": "Apache Kafka",
  "technology.kafka.description": "Working with Kafka for highly scalable and efficient message management and consumption, for high-volume intake",
  "technology.mongo": "MongoDB",
  "technology.mongo.description": "I have good skills in MongoDB to deal with non-relational and unstructured databases",
  "technology.psql": "Relational Databases",
  "technology.psql.description": "Minha escolha primária de Banco de Dados é o PostgreSQL, também tenho conhecimentos com MySQL, MariaDB e Oracle para trabalhar com dados estruturados.",
  "technology.rabbit": "RabbitMQ",
  "technology.rabbit.description": "Working with RabbitMQ for message management and consumption, for sending data between microservices, and for file processing",
  "technology.redis": "Redis",
  "technology.redis.description": "I have Redis knowledge to deal with in-memory databases for local caching of structured information",
  "technology.spring": "Spring",
  "technology.spring.description": "Spring is my specialization. I work daily with Spring Web projects, Spring Webflux, Spring data, Spring Cloud, Spring Kafka, Spring Security, among others...",
  "tecnologias": "Technologies",
  "who-am-i.1": "I am a passionate programmer with experience in large and complex projects. I currently work at <a class='link' href='https://www.wswork.com.br/' target='_blank' rel='noopener noreferrer'>WS Work</a>, a development outsourcing company, with clients like Samarco, Fast2Mine, e.Sales, Creare and Privacy Tools. And I have the opportunity to work on large scale and impactful projects.",
  "who-am-i.2": "I worked for <a class='link' href='https://privacytools.com.br/' target='_blank' rel='noopener noreferrer'>Privacy Tools</a>, for almost a year. Developing complex solutions to help companies be in compliance with LGPD. <br/> <br/>  I contributed to the design and implementation of efficient processes for managing complex data to facilitate compliance with LGPD regulations Implementing security measures to ensure data privacy and protection.<br/> <br/>  Working with development teams, legal experts, and product managers Training new developers to understand operation, structure, and technologies. I proactively identified and addressed potential risks, ensuring project success. <br/> <br/> I established a reputation as a good and reliable developer on the team, and became a figure to be consulted by others.",
  "who-am-i.3": "I currently provide services to  <a class='link' href='https://www.crearesistemas.com.br/' target='_blank' rel='noopener noreferrer'>Creare Sistemas</a>, a dynamic and fast-paced company, providing advanced fleet management solutions for large companies <br/> <br/>  I deal with a large microservices infrastructure, managing a large telemetric data flow in order to monitor in real time the situation of fleets.<br/> <br/>  I develop and maintain scalable, secure and reliable applications that meet customer needs and expectations<br/> <br/>  I contribute to the continuous improvement of the company's product offering by suggesting and implementing new features and functionality.Seeking to solve complex technical problems and working to resolve them in a timely manner."
}