{
  "about.me": "Sobre Mim",
  "contate-me": "Contate-me",
  "cury": "CURY",
  "desenvolvedor.backend.pleno": "Desenvolvedor Backend Pleno",
  "experiencia": "Experiência",
  "languages.java": "Java",
  "languages.java.description": "No meu dia-a-dia, lado a lado do Kotlin, Uso para desenvolver e fazer manutenção de sistemas backend escritos em Java, como Spring e Serviços Java EE (Web, JDBC, Tomcat)",
  "languages.kotlin": "Kotlin",
  "languages.kotlin.description": "Minha linguagem primária junto com Java, uso no meu dia-a-dia para desenvolver os serviçõs Back End. Desde que comecei à usá-la me apaixonei",
  "languages.nodejs": "Node.JS",
  "languages.nodejs.description": "Node é minha linguagem coringa, uso ela tanto desenvolvimento Front End, automação de processos e Back End. Construí e dei manutenção em sites, crawlers (Puppeteer), API's, entre outros...",
  "languages.python": "Python",
  "name.first": "Rodrigo",
  "name.last": "Cury",
  "rodrigo.cury": "Rodrigo Cury",
  "sobre.o.portifolio": "Sobre o Portifólio",
  "technology.aws": "AWS",
  "technology.docker": "Docker",
  "technology.docker.description": "Trabalho com docker diariamente para desenvolver em ambientes idênticos à produção e diminuir inconsitências",
  "technology.front": "Front End",
  "technology.front.description": "Minha especialização é Back End, porém adoro trabalahr com interfaces criativas em meu tempo livre. Tenho boas noções com React.js. Consigo trabalhar bem com HTML, CSS e JS Vanilla. Tenho paixão em trabalhar com Three.js para criar interfaces 3D. Profissionalmente, sempre que necessário, vou ajudar a equipe Front End em suas entregas.",
  "technology.git": "Git",
  "technology.git.description": "Git é minha ferramenta principal de versionamento de código",
  "technology.kafka": "Apache Kafka",
  "technology.kafka.description": "Kafka é meu ecossistema de mensageria de escolha por sua alta escalabilidade e disponibilidade",
  "technology.mongo": "MongoDB",
  "technology.mongo.description": "Tenho bons fudamentos em MongoDB para lidar com bancos não relacionais e não estruturados",
  "technology.psql": "Banco Relacional",
  "technology.psql.description": "Minha escolha primária de Banco de Dados é o PostgreSQL, também tenho conhecimentos com MySQL, MariaDB e Oracle",
  "technology.python.description": "Python foi minha primeira paixão, com ele aprendi a programar, os Conceitos de Back end, automação e manipulação de bancos de dados. Fiz Projetos usando Django e Flask.",
  "technology.redis": "Redis",
  "technology.redis.description": "Tenho fundamentos em Redis para lidar com banco em memória para cacheamento local de informação estruturadas",
  "technology.spring": "Spring",
  "technology.spring.description": "Spring é minha especialização atual. Trabalho diariamente com projetos Spring Web, Spring Webflux, Spring data, Spring Cloud, Spring Kafka, Spring Security, etc...",
  "tecnologias": "Tecnologias",
  "who-am-i.1": "Sou um programador apaixonado, com experiência em projetos grandes e complexos. Atualmente trabalho na <a class='link' href='https://www.wswork.com.br/' target='_blank' rel='noopener noreferrer'>WS Work</a>, uma empresa de terceirização de desenvolvimento, com clientes como Samarco, Fast2Mine, e.Sales, Creare e Privacy Tools. E tenho a oportunidade de trabalhar em projetos de grande escala e impacto." ,
  "who-am-i.2": "Trabalhei para a <a class='link' href='https://privacytools.com.br/' target='_blank' rel='noopener noreferrer'>Privacy Tools</a>, por quase um ano. Desenvolvendo soluções complexas para auxiliar empresas a estarem em conformidade com a LGPD.<br/> <br/>Contribuí com a concepção e implementação de processos eficientes para gestão de dados complexos para facilitar o cumprimento de regulamentos da LGPD. Implementando medidas de segurança para garantir privacidade e proteçãode dados.<br/> <br/>Trabalhando com equipes de desenvolvimento, juristas e gerentes de produto. Treinando novos desenvolvedores para entenderem o funcionamento, estrutura e tecnologias. Identifiquei e abordei proativamente potenciais riscos, garantindo o sucesso do projeto. <br/> <br/>Estabeleci uma reputação como bom desenvolvedor e confiável na equipe, e me tornei uma figura a ser consultada por outros.",
  "who-am-i.3": "Atualmente presto serviços à <a class='link' href='https://www.crearesistemas.com.br/' target='_blank' rel='noopener noreferrer'>Creare Sistemas</a>,  uma empresa dinâmica e de ritmo acelerado, fornecendo soluções avançadas de gerenciamento de frotas para grandes empresas<br/><br/>Lido com uma grande infraestutura de microserviços, gerenciando um grande fluxo de dados telemetricos, a fim de monitorar em tempo real a situação de frotas.<br/><br/>Desenvolvo e mantenho aplicações escaláveis, seguras e confiáveis que atendem às necessidades e expectativas dos clientes<br/>Contribuo para a melhoria contínua da oferta de produtos da empresa sugerindo e implementando novas características e funcionalidades.Procurando resolver problemas técnicos complexos e trabalhei para resolvê-los em tempo hábil."
}