{
  "desenvolvedor.backend.pleno": "Desenvolvedor Backend Pleno",
  "rodrigo.cury": "Rodrigo Cury",
  "about.me": "Sobre Mim",
  "experiencia": "Experiência",
  "tecnologias": "Tecnologias",
  "sobre.o.portifolio": "Sobre o Portifólio",
  "contate-me": "Contate-me",
  "cury": "CURY",
  "languages.kotlin": "Kotlin",
  "languages.kotlin.description": "Minha linguagem primária junto com Java, uso no meu dia-a-dia para desenvolver os serviçõs Back End. Desde que comecei à usá-la me apaixonei",
  "languages.java": "Java",
  "languages.java.description": "No meu dia-a-dia, lado a lado do Kotlin, Uso para desenvolver e fazer manutenção de sistemas backend escritos em Java, como Spring e Serviços Java EE (Web, JDBC, Tomcat)",
  "languages.nodejs": "Node.JS",
  "languages.nodejs.description": "Node é minha linguagem coringa, uso ela tanto desenvolvimento Front End, automação de processos e Back End. Construí e dei manutenção em sites, crawlers (Puppeteer), API's, entre outros...",
  "languages.python": "Python",
  "technology.python.description": "Python foi minha primeira paixão, com ele aprendi a programar, os Conceitos de Back end, automação e manipulação de bancos de dados. Fiz Projetos usando Django e Flask.",
  "technology.spring": "Spring",
  "technology.spring.description": "Spring é minha especialização atual. Trabalho diariamente com projetos Spring Web, Spring Webflux, Spring data, Spring Cloud, Spring Kafka, Spring Security, etc...",
  "technology.docker": "Docker",
  "technology.docker.description": "Trabalho com docker diariamente para desenvolver em ambientes idênticos à produção e diminuir inconsitências",
  "technology.git": "Git",
  "technology.git.description": "Git é minha ferramenta principal de versionamento de código",
  "technology.kafka": "Apache Kafka",
  "technology.kafka.description": "Kafka é meu ecossistema de mensageria de escolha por sua alta escalabilidade e disponibilidade",
  "technology.psql": "Banco Relacional",
  "technology.psql.description": "Minha escolha primária de Banco de Dados é o PostgreSQL, também tenho conhecimentos com MySQL, MariaDB e Oracle",
  "technology.mongo": "MongoDB",
  "technology.mongo.description": "Tenho bons fudamentos em MongoDB para lidar com bancos não relacionais e não estruturados",
  "technology.redis": "Redis",
  "technology.redis.description": "Tenho fundamentos em Redis para lidar com banco em memória para cacheamento local de informação estruturadas",
  "technology.front": "Front End",
  "technology.front.description": "Minha especialização é Back End, porém adoro trabalahr com interfaces criativas em meu tempo livre. Tenho boas noções com React.js. Consigo trabalhar bem com HTML, CSS e JS Vanilla. Tenho paixão em trabalhar com Three.js para criar interfaces 3D. Profissionalmente, sempre que necessário, vou ajudar a equipe Front End em suas entregas.",
  "technology.aws": "AWS",
  "name.first": "Rodrigo",
  "name.last": "Cury",
  "who-am-i.1": "Sou um desenvolvedor Brasileiro. Tenho uma painhão séria por desenvolvimento Back-End e participar do processo de criação sistemas que solucionam problemas complexos com eficácia e eficiência.",
  "who-am-i.2": "Sou um homem bem organizado.<br/> Amo trabalhar em equipe, absorvendo e compartilhando conhecimento. Capaz de funcionar de forma independente.",
  "who-am-i.3": "Sou interessado por todo o espectro Back-End, equipado com as ferramentas corretas para o trabalho. entregando soluções resilientes e optimizadas para escala."
}
